SimpleSoapService/src/main/resources/soap-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:web="http://example.com/web">
    <soapenv:Header/>
    <soapenv:Body>
        <web:YourSoapRequest>
            <!-- Add your fields here -->
        </web:YourSoapRequest>
    </soapenv:Body>
</soapenv:Envelope>